---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarConstraint.IsValid
source: html/8e6a4ccb-21db-1245-e361-a1341efa5f11.htm
---
# Autodesk.Revit.DB.Structure.RebarConstraint.IsValid Method

Checks that the RebarConstraint still has access to valid Rebar constraint data
 and that its RebarConstraintsManager is still valid.

## Syntax (C#)
```csharp
public bool IsValid()
```